app/controllers/powers_controller.rb

  def find_power
    Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]